# Customer Segmentation for Winery

## Purpose


The purpose of this analysis is to better understand customers of a winery to determine the best offers to make to them.    i.e. this provides a better customer experience for the winery's customers--by communicating more relevant products to them, and also aims to improve revenue for the winery by increasing purchases from customers.

It leverages a data set (excel file) with information about the offers the winery made and purchases made by customers. We aim to create segements of customers with similar behaivour, leveraging these two data sets.

## Approach

 1. **Source data**
    * Load data
    * Explore data

## Load relevant libraries

In [2]:
%matplotlib inline
import pandas as pd
import sklearn
import matplotlib.pyplot as plt

## 1. Source Data

 *  ###  Load data

In [3]:
df_offers = pd.read_excel("./WineKMC.xlsx", sheet_name=0)

### 1b. Explore the data

In [4]:
df_offers.head()

,Offer #,Campaign,Varietal,Minimum Qty (kg),Discount (%),Origin,Past Peak
0,1,January,Malbec,72,56,France,False
1,2,January,Pinot Noir,72,17,France,False
2,3,February,Espumante,144,32,Oregon,True
3,4,February,Champagne,72,48,France,True
4,5,February,Cabernet Sauvignon,144,44,New Zealand,True

In [5]:
# Rename columns for better reference later
df_offers.columns = ["offer_id", "campaign", "varietal", "min_qty", "discount", "origin", "past_peak"]
df_offers.head()

,offer_id,campaign,varietal,min_qty,discount,origin,past_peak
0,1,January,Malbec,72,56,France,False
1,2,January,Pinot Noir,72,17,France,False
2,3,February,Espumante,144,32,Oregon,True
3,4,February,Champagne,72,48,France,True
4,5,February,Cabernet Sauvignon,144,44,New Zealand,True

In [6]:
df_offers.tail()

,offer_id,campaign,varietal,min_qty,discount,origin,past_peak
27,28,November,Cabernet Sauvignon,12,56,France,True
28,29,November,Pinot Grigio,6,87,France,False
29,30,December,Malbec,6,54,France,False
30,31,December,Champagne,72,89,France,False
31,32,December,Cabernet Sauvignon,72,45,Germany,True

In [7]:
df_offers.sample(13)

,offer_id,campaign,varietal,min_qty,discount,origin,past_peak
7,8,March,Espumante,6,45,South Africa,False
2,3,February,Espumante,144,32,Oregon,True
1,2,January,Pinot Noir,72,17,France,False
26,27,October,Champagne,72,88,New Zealand,False
14,15,June,Cabernet Sauvignon,144,19,Italy,False
9,10,April,Prosecco,72,52,California,False
5,6,March,Prosecco,144,86,Chile,False
15,16,June,Merlot,72,88,California,False
23,24,September,Pinot Noir,6,34,Italy,False
8,9,April,Chardonnay,144,57,Chile,False
11,12,May,Prosecco,72,83,Australia,False
19,20,August,Cabernet Sauvignon,72,82,Italy,False
0,1,January,Malbec,72,56,France,False

In [8]:
df_offers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   offer_id   32 non-null     int64
 1   campaign   32 non-null     object
 2   varietal   32 non-null     object
 3   min_qty    32 non-null     int64
 4   discount   32 non-null     int64
 5   origin     32 non-null     object
 6   past_peak  32 non-null     bool
dtypes: bool(1), int64(3), object(3)
memory usage: 1.7+ KB

In [9]:
df_offers.shape

(32, 7)

We see that the first dataset contains information about each offer...e.g:
 * month of the offer 
 * the wine variety 
 * minimum quantity
 * discount
 * country of origin
 * whether or not it is past peak.

 Lets take a look at the second dataset.

In [10]:
df_transactions = pd.read_excel("./WineKMC.xlsx", sheet_name=1)
df_transactions.head()

  Customer Last Name  Offer #
0              Smith        2
1              Smith       24
2            Johnson       17
3            Johnson       24
4            Johnson       26

In [11]:
# Rename columns
df_transactions.columns = ["customer_name", "offer_id"]
df_transactions.head()

  customer_name  offer_id
0         Smith         2
1         Smith        24
2       Johnson        17
3       Johnson        24
4       Johnson        26

In [12]:
df_transactions.tail()

    customer_name  offer_id
319        Fisher        11
320        Fisher        22
321        Fisher        28
322        Fisher        30
323        Fisher        31

In [13]:
df_transactions.sample(13)

    customer_name  offer_id
158        Parker        11
123         Baker         7
179        Rivera         7
126         Baker        31
106       Sanchez        14
184        Rogers         7
125         Baker        19
296       Russell        26
119         Scott         6
230    Richardson         6
272        Foster        14
212         Gomez        32
218        Howard        12

In [14]:
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 324 entries, 0 to 323
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_name  324 non-null    object
 1   offer_id       324 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.2+ KB

In [15]:
df_transactions.shape

(324, 2)